# GetDlgCtrlWidthStdCh

## Description
Returns the width in standard characters for dialog control creation. &lt;BR&gt;
&lt;BR&gt;
The width is different than the number of symbols (Len) as in some languages (Japanese for example) the symbols are very different in size on the dialog.&lt;BR&gt;
&lt;BR&gt;
E.g. CreateStaticText

```pascal
FUNCTION GetDlgCtrlWidthStdCh(str : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.GetDlgCtrlWidthStdCh(str):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|str|DYNARRAY[] of CHAR|The string used to calculate the std character count.|

## Returns
Return the number of std characters in the input string.

## See Also
VS Functions:
CreateStaticText| CreateCenteredStaticText| CreateStyledStatic| CreateEditInteger| CreateEditReal| CreateEditText| CreateEditTextBox| CreateListBox| CreateListBoxN| CreateLB| CreatePullDownMenu| CreateEnhancedPullDownMenu| CreateColorPopup| CreatePullDownMenuGroupBox| CreateTreeControl| CreateClassPullDownMenu| CreateDesignLayerPullDownMenu| CreateSheetLayerPullDownMenu

## Version
Availability: from Vectorworks 2019
## Category
* Dialogs - Modern